OSPP/OSPP2025/江飞兵-25aca0558-结项报告/lock-sched/test_db/benchmark_results_2025-08-26_07-36-46/cfs_64threads.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 2673.36 qps: 53567.51 (r/w/o: 37510.15/10704.24/5353.12) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 2252.70 qps: 45046.95 (r/w/o: 31533.93/9007.61/4505.40) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 2213.40 qps: 44266.10 (r/w/o: 30984.20/8855.10/4426.80) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 2222.48 qps: 44444.45 (r/w/o: 31109.25/8890.23/4444.96) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 2215.92 qps: 44333.76 (r/w/o: 31039.65/8862.37/4431.74) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 2351.50 qps: 46993.91 (r/w/o: 32888.14/9402.68/4703.09) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 2344.70 qps: 46922.34 (r/w/o: 32852.73/9380.21/4689.40) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 2323.20 qps: 46464.23 (r/w/o: 32527.42/9290.41/4646.40) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 2283.00 qps: 45653.80 (r/w/o: 31952.60/9135.70/4565.50) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 2305.60 qps: 46111.61 (r/w/o: 32274.81/9225.10/4611.70) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 2345.80 qps: 46913.64 (r/w/o: 32844.33/9377.71/4691.60) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 2355.90 qps: 47112.03 (r/w/o: 32974.42/9425.81/4711.80) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3905174
        write:                           1115764
        other:                           557882
        total:                           5578820
    transactions:                        278941 (2323.78 per sec.)
    queries:                             5578820 (46475.68 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0370s
    total number of events:              278941

Latency (ms):
         min:                                    2.94
         avg:                                   27.53
         max:                                  855.90
         95th percentile:                       58.92
         sum:                              7680326.52

Threads fairness:
    events (avg/stddev):           4358.4531/37.97
    execution time (avg/stddev):   120.0051/0.01