OSPP/OSPP2025/江飞兵-25aca0558-结项报告/lock-sched/test_db/benchmark_results_2025-08-26_07-36-46/scx_contention_16threads.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 1707.00 qps: 34163.96 (r/w/o: 23917.24/6831.11/3415.61) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1643.31 qps: 32863.97 (r/w/o: 23005.62/6571.73/3286.62) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1593.20 qps: 31863.41 (r/w/o: 22304.61/6372.40/3186.40) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1567.90 qps: 31356.13 (r/w/o: 21948.22/6272.11/3135.80) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1528.13 qps: 30561.11 (r/w/o: 21393.36/6111.60/3056.15) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1550.82 qps: 31019.78 (r/w/o: 21713.33/6204.70/3101.75) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 1524.34 qps: 30484.52 (r/w/o: 21339.77/6096.06/3048.68) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 1525.29 qps: 30507.95 (r/w/o: 21354.59/6102.77/3050.58) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 1493.62 qps: 29874.72 (r/w/o: 20914.22/5973.26/2987.23) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 1521.28 qps: 30425.39 (r/w/o: 21296.98/6085.84/3042.57) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 1483.90 qps: 29674.73 (r/w/o: 20770.72/5936.21/2967.80) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 1503.81 qps: 30077.42 (r/w/o: 21055.66/6014.14/3007.62) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2610202
        write:                           745772
        other:                           372886
        total:                           3728860
    transactions:                        186443 (1553.51 per sec.)
    queries:                             3728860 (31070.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0133s
    total number of events:              186443

Latency (ms):
         min:                                    2.43
         avg:                                   10.30
         max:                                  128.71
         95th percentile:                       18.28
         sum:                              1919764.20

Threads fairness:
    events (avg/stddev):           11652.6875/34.84
    execution time (avg/stddev):   119.9853/0.00